-- MySQL dump 10.13  Distrib 8.0.33, for Win64 (x86_64)
--
-- Host: j9c202.p.ssafy.io    Database: asap
-- ------------------------------------------------------
-- Server version	8.0.34-0ubuntu0.20.04.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `notice`
--

DROP TABLE IF EXISTS `notice`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `notice` (
  `is_read` bit(1) NOT NULL,
  `create_date` datetime(6) DEFAULT NULL,
  `member_id` bigint DEFAULT NULL,
  `modify_date` datetime(6) DEFAULT NULL,
  `notice_id` bigint NOT NULL AUTO_INCREMENT,
  `content` varchar(255) NOT NULL,
  `title` varchar(255) NOT NULL,
  PRIMARY KEY (`notice_id`),
  KEY `FKnriaekshh15qoqnlhvqkj931e` (`member_id`),
  CONSTRAINT `FKnriaekshh15qoqnlhvqkj931e` FOREIGN KEY (`member_id`) REFERENCES `member` (`member_id`)
) ENGINE=InnoDB AUTO_INCREMENT=162 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `notice`
--

LOCK TABLES `notice` WRITE;
/*!40000 ALTER TABLE `notice` DISABLE KEYS */;
INSERT INTO `notice` VALUES (_binary '','2023-09-24 00:00:18.217769',408,'2023-09-24 00:01:06.257708',96,'안알려줌','지은아 안녕 난 누구게'),(_binary '\0','2023-09-24 00:01:18.654658',408,'2023-09-24 00:01:18.654658',97,'안알려줌','지은아 안녕 난 누구게'),(_binary '\0','2023-09-24 00:02:19.050406',408,'2023-09-24 00:02:19.050406',98,'안알려줌','지은아 안녕 난 누구게'),(_binary '\0','2023-09-24 00:03:19.494496',408,'2023-09-24 00:03:19.494496',99,'안알려줌','지은아 안녕 난 누구게'),(_binary '','2023-09-24 00:04:19.906351',408,'2023-09-30 16:00:55.439990',100,'안알려줌','지은아 안녕 난 누구게'),(_binary '\0','2023-09-24 00:04:54.106230',408,'2023-09-24 00:04:54.106230',101,'안알려줌','지은아 안녕 난 누구게'),(_binary '\0','2023-09-24 00:05:54.623659',408,'2023-09-24 00:05:54.623659',110,'안알려줌','지은아 안녕 난 누구게'),(_binary '\0','2023-09-24 00:06:46.167731',408,'2023-09-24 00:06:46.167731',116,'안알려줌','지은아 안녕 난 누구게'),(_binary '\0','2023-09-24 00:07:46.675453',408,'2023-09-24 00:07:46.675453',118,'안알려줌','지은아 안녕 난 누구게'),(_binary '\0','2023-09-24 00:08:47.036064',413,'2023-09-24 00:08:47.036064',119,'안알려줌','서희야 안녕 난 누구게'),(_binary '\0','2023-09-24 00:08:47.376103',408,'2023-09-24 00:08:47.376103',120,'안알려줌','지은아 안녕 난 누구게'),(_binary '\0','2023-09-24 00:09:47.829337',408,'2023-09-24 00:09:47.829337',121,'안알려줌','지은아 안녕 난 누구게'),(_binary '\0','2023-09-24 00:10:48.251524',408,'2023-09-24 00:10:48.251524',123,'안알려줌','지은아 안녕 난 누구게'),(_binary '\0','2023-09-24 00:11:48.658742',408,'2023-09-24 00:11:48.658742',124,'안알려줌','지은아 안녕 난 누구게'),(_binary '\0','2023-09-24 00:12:49.074603',408,'2023-09-24 00:12:49.074603',126,'안알려줌','지은아 안녕 난 누구게'),(_binary '\0','2023-09-24 00:13:49.551660',408,'2023-09-24 00:13:49.551660',127,'안알려줌','지은아 안녕 난 누구게'),(_binary '\0','2023-09-24 00:14:50.644877',408,'2023-09-24 00:14:50.644877',129,'안알려줌','지은아 안녕 난 누구게'),(_binary '\0','2023-09-24 00:15:51.063484',408,'2023-09-24 00:15:51.063484',130,'안알려줌','지은아 안녕 난 누구게'),(_binary '\0','2023-09-24 00:16:51.474911',408,'2023-09-24 00:16:51.474911',132,'안알려줌','지은아 안녕 난 누구게'),(_binary '\0','2023-09-24 00:17:51.848700',408,'2023-09-24 00:17:51.848700',133,'안알려줌','지은아 안녕 난 누구게'),(_binary '\0','2023-09-24 00:18:52.220355',408,'2023-09-24 00:18:52.220355',135,'안알려줌','지은아 안녕 난 누구게'),(_binary '\0','2023-09-24 00:19:52.601309',408,'2023-09-24 00:19:52.601309',136,'안알려줌','지은아 안녕 난 누구게'),(_binary '','2023-09-24 00:26:08.863765',408,'2023-09-25 12:59:19.672818',145,'안알려줌','지은아 안녕 난 누구게'),(_binary '','2023-09-24 00:28:23.818639',408,'2023-09-24 01:01:17.459139',148,'안알려줌','지은아 안녕 난 누구게'),(_binary '\0','2023-09-28 14:57:05.873748',413,'2023-09-28 14:57:05.873748',155,'API 신청이 성공적으로 승인되었습니다!','\'키워드로 장소 검색하기\' 건에 대한 신청이 승인되었습니다.'),(_binary '\0','2023-09-29 00:45:35.711700',413,'2023-09-29 00:45:35.711700',156,'API 신청이 성공적으로 승인되었습니다!','\'카테고리로 장소 검색하기\' 건에 대한 신청이 승인되었습니다.'),(_binary '','2023-10-04 08:51:07.542016',413,'2023-10-04 11:06:45.466975',157,'API 신청이 성공적으로 승인되었습니다!','\'KoGPT에게 요청하기\' 건에 대한 신청이 승인되었습니다.'),(_binary '','2023-10-04 12:13:48.083446',413,'2023-10-05 10:30:38.947471',158,'API 신청이 성공적으로 승인되었습니다!','\'웹문서 검색하기\' 건에 대한 신청이 승인되었습니다.'),(_binary '\0','2023-10-04 16:53:30.414496',408,'2023-10-04 16:53:30.414496',159,'API 신청이 성공적으로 승인되었습니다!','\'나도 신청하게 해줘\' 건에 대한 신청이 승인되었습니다.'),(_binary '\0','2023-10-05 01:47:54.219331',454,'2023-10-05 01:47:54.219331',160,'API 신청이 성공적으로 승인되었습니다!','\'책 검색하기\' 건에 대한 신청이 승인되었습니다.'),(_binary '\0','2023-10-05 09:47:01.504036',454,'2023-10-05 09:47:01.504036',161,'API 신청이 성공적으로 승인되었습니다!','\'자동차 길찾기\' 건에 대한 신청이 승인되었습니다.');
/*!40000 ALTER TABLE `notice` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-10-05 14:59:47
